/*
Задание 3.
Реализовать алгоритм пирамидальной сортировки (HeapSort).
 */
public class Main {
    public static void main(String[] args) {

        System.out.println("Hello world!");
    }
}