/*
Задание 1.
Реализуйте структуру телефонной книги с помощью HashMap, учитывая,
что 1 человек может иметь несколько телефонов.
 */

public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}